; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 817269 2 1 4 5 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	spectrograph2 - mode
	infrared0 - mode
	thermograph3 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(pointing satellite1 GroundStation4)
	(have_image Star5 spectrograph2)
	(have_image Phenomenon6 image1)
	(have_image Star7 infrared0)
	(have_image Star8 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 star8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
4. (turn_to satellite1 star5 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star5)
   goals met: 0 of 5
5. (turn_to satellite1 star2 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star2)
   goals met: 0 of 5
6. (turn_to satellite0 groundstation4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 5
7. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 5
8. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 5
9. (turn_to satellite1 star5 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star5)
   goals met: 0 of 5
10. (turn_to satellite0 star8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
11. (take_image satellite1 star5 instrument1 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 1 of 5
12. (take_image satellite0 star8 instrument0 infrared0)
   added: (have_image star8 infrared0)
   goals met: 2 of 5
13. (turn_to satellite1 groundstation4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation4)
   goals met: 3 of 5
14. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 3 of 5
15. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 4 of 5
16. (turn_to satellite1 phenomenon6 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 5
17. (take_image satellite1 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 4 of 5
18. (turn_to satellite1 groundstation4 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation4)
   goals met: 5 of 5
